package class_;

public class Ex2_0221_class {

	public static void main(String[] args) {
		// class - 설계도 (연관성 있는 변수, 동작들의 모음)
		// object - 설계도를 따라 만들어진 부품 , 속성과 기능으로 구성된다.
		// 교재 127p, 클래스와 객체1 !! >> 요쯤 .. 나중에 확인하자 !!
		// 눈에 보이지 않는 것도 객체가 될 수 있다 ~
		// 어떠한 대상을 가지고 프로그래밍 해 나간다 !! 객체지향 프로그래밍
		//	예) 아침에 일어나서 학교를 가는 과정 > 시간순서대로 프로그래밍 > 절차지향 프로그래밍
		//										 > 객체간의 상호작용(협력)을 중심으로 프로그래밍 > 객체지향 프로그래밍
		// 객체간의 협력을 고민해야 한다 !!
		// 
		// class : 객체의 속성과 기능의 집합
		// class 학생 > class student [address, studentNumber, score ...] > [멤버변수 1, 멤버변수 2 ...]
		// String snack = "새우깡 "
		//          > 멤버변수
		//
		//
		// room7_stdent1{
		//  name: OOO
		//  age: 22
		// }
		// 
		// room7_stdent2{
		//  name: PPP
		//  age: 22
		// }
		// 
		// room7_stdent3{
		//  name: ZZZ
		//  age: 22
		// }											// > 절차지향 프로그래밍, 하나하나 순서대로 만들어 줘야 한다.
		// 
		//												// > 위와 달리 틀(class)을 만들어서 프로그래밍 하는것이 객체 지향.
		//												//	 예시 많이 만들면서 이해해 나가자.
		
		//인스턴스 :
		// class로부터 만들어진 object를 JAVA에서 인스턴스라고 부른다.
		// 프로그램적으로 표현되는 객체.(프로그램 언어로 적힌것..)
		// 인스턴스의 묶음 >> 객체지향 프로그래밍.
		
		// 설계도 > 객체		(현실)
		// 클래스 > 인스턴스	(자바)
		
		// 인스턴스는 아래와 같은 절차를 통하여 구현하게 된다.
		// 1. 요구사항 분석 (중요)
		// 2. 클래스의 설계
		// 3. 설계된 클래스로부터 객체 생성(인스턴스 생성)
		// 4. 인스턴스를 통한 프로그램 구현

	}

}
